Autodesk.Navisworks.Api.Plugins.PluginAttribute
The standard attribute which must be applied to all plug-ins.

Autodesk.Navisworks.Api.Plugins.PluginAttribute.#ctor(System.String,System.String)
The standard attribute constructor which must be applied to all plug-ins.
The combination of Name and DeveloperId should make the plugin unique
name: The name of the Plugin.
developerId: The 4 character ADN developer code or a GUID.

Autodesk.Navisworks.Api.Plugins.PluginAttribute.DeveloperId
The 4 character ADN developer code or a GUID. The combination of this and Name should make the plugin unique

Autodesk.Navisworks.Api.Plugins.PluginAttribute.DisplayName
Text to display in the Navisworks GUI

Autodesk.Navisworks.Api.Plugins.PluginAttribute.ExtendedToolTip
The extended tooltip to display when the Plugin is highlighted in the Navisworks GUI

Autodesk.Navisworks.Api.Plugins.PluginAttribute.Name
The name of the Plugin. The combination of this and DeveloperId should make the plugin unique

Autodesk.Navisworks.Api.Plugins.PluginAttribute.Options
Options that modify how a plugin behaves

Autodesk.Navisworks.Api.Plugins.PluginAttribute.SupportsIsSelfEnabled
Determines if Plugin.IsSelfEnabled will be called.

Autodesk.Navisworks.Api.Plugins.PluginAttribute.ToolTip
The tooltip to display when the Plugin is highlighted in the Navisworks GUI